Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/claiming_a_social_welfare_payment/household_budget_scheme.html.txt.tmx
Source language: en
Languages: ga

source: The Household Budget Scheme is a scheme that helps those getting certain social welfare payments in Ireland to spread the cost of some household bills over the year
ga: Is scéim í an Scéim Bhuiséadta Teaghlaigh a chabhraíonn leo siúd a fhaigheann íocaíochtaí leasa shóisialaigh áirithe in Éirinn chun costas roinnt billí tí a roinnt amach thar an bhliain uilig

source: Under this scheme, a fixed amount is deducted from your social welfare payment each week
ga: Baintear méid socraithe ó d'íocaíochtaí leasa shóisialaigh chuile sheachtain faoin scéim seo

source: The scheme is operated by An Post and in order to qualify, you must be getting a specified social welfare payment and your payment must be paid through your local post office
ga: An Post a riarann an scéim. Ní mór duit a bheith ag fáil íocaíochta leasa shóisialaigh áirithe agus caithfear d'íocaíocht a íoc tríd oifig an phoist áitiúil ionas go gcáileoidh tú don scéim

source: The Household Budget Scheme is free of charge
ga: Tá an Scéim Bhuiséadta Teaghlaigh saor ó tháille

source: To qualify for the Household Budget Scheme you must be getting one of the following social welfare payments:
ga: Ní mór duit a bheith ag fáil ceann amháin de na híocaíochtaí seo a leanas chun cáiliú don Scéim Bhuiséadta Teaghlaigh:

source: • Back to Work Allowance
ga: • Liúntas um Fhilleadh ar Obair

source: • Jobseeker’s Allowance (and Jobseeker's Transitional payment)
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: • Widow’s, Widower’s or Surviving Civil Partner's (Contributory) Pension
ga: • Liúntas um Fhilleadh ar Oideachas

source: • Widow’s, Widower’s or Surviving Civil Partner's (Non–Contributory) Pension
ga: • Liúntas Fiontraíochta um Fhilleadh ar Obair

source: What bills can I pay under the Household Budget Scheme?
ga: Céard iad na billí is féidir liom a íoc leis an Scéim Bhuiséadta Teaghlaigh?

source: Currently you can pay the following service providers under the Scheme:
ga: Seo a leanas an líon teoranta billí is féidir leat a íoc ag úsáid na Scéime Buiséadta Teaghlaigh:

source: • Local authority rent and Housing Assistance Payment (HAP) contributions (for new applications, from 1 January 2014, you cannot withdraw from the scheme without the consent of your housing body)
ga: • Cíos údaráis áitiúil (maidir le hiarratais nua, ó 1 Eanáir 2014, ní féidir leat tarraing as an scéim, gan toiliú do chomhlacht tithíochta)

source: The Social Welfare Act 2012 made changes to the suppliers that can be paid under the Household Budget Scheme
ga: Rinne an tAcht Leasa Shóisialaigh 2012 athrú ar na soláthróirí a íoctar leo faoin Scéim Buiséadta Teaghlaigh

source: However, An Post must have an agreement in place with the relevant supplier to make deductions from your social welfare payment
ga: Áfach, caithfidh an Post comhaontú le soláthróir ábhartha a bheith aige chun asbhaintí as d’íocaíocht a dhéanamh

source: You should speak to An Post to see if your supplier is availing of the Household Budget facility
ga: Ba chóir duit dul i dteagmháil leis an bPost a fháil amach an bhfuil do sholáthróirí ag baint úsáid as an áis Bhuiséadta Teaghlaigh

source: If your service provider is not listed above, you cannot pay them under the Household Budget Scheme
ga: Mura bhfuil do sholáthraí seirbhíse sa liosta thuas, ní féidir leat na billí a íoc leis an Scéim Bhuiséadta Teaghlaigh

source: You must be getting one of the social welfare payments listed above to apply for the Household Budget Scheme
ga: Tabhair ar aird freisin, nach féidir iarratas a dhéanamh ar an Scéim Bhuiséadta Teaghlaigh mura bhfuil tú ag fáil ceann de na híocaíochtaí leasa shóisialaigh thuas

source: How much can I deduct?
ga: Cé mhéad is féidir liom a asbhaint?

source: You can opt to cover the full amount of the bill
ga: Féadfaidh tú méid iomlán an bhille a íoc má thograíonn tú

source: You cannot however have more than 25% of your total weekly social welfare payment deducted under this scheme
ga: Ní féidir leat níos mó ná 25% de d'íocaíocht iomlán sheachtainiúil leasa shóisialaigh a asbhaint leis an Scéim seo

source: A minimum amount must be deducted each week for each bill to be paid under the Household Budget Scheme
ga: Tá íosmhéid gur gá a asbhaint chuile sheachtain le haghaidh gach bille a íoctar leis an Scéim Bhuiséadta Teaghlaigh

source: The deduction from your payment will be passed on to pay your bill within 4 days of you getting your payment at the post office
ga: Cuirfear an asbhaint ó d'íocaíocht i dtreo do bhille a íoc taobh istigh de 4 lá ón uair go bhfaigheann tú an íocaíocht ag oifig an phoist

source: Can I change the amount deducted?
ga: An féidir liom méid na hasbhainte a athrú?

source: To make changes to current deductions, you must complete a new Household Budget Instruction Form and send it to the address below
ga: Caithfidh tú Foirm Ordaithe nua don Scéim Bhuiséadta Teaghlaigh a chomhlíonadh chun na hasbhaintí reatha a athrú, agus caithfidh tú an fhoirm a sheoladh chuig an seoladh thíos

source: If you want to make changes to the deductions paid to a housing body you must include a letter of authorisation from the housing body
ga: Más mian leat na hasbhaintí íoctha le comhlacht tithíochta a athrú, caithfidh tú litir údaraithe ón gcomhlacht tithíochta a iniamh

source: How can I stop a deduction?
ga: Conas a chuirfidh mé deireadh le hasbhaint?

source: To cancel a deduction you must give 2 weeks written notice to An Post (see address below)
ga: Chun asbhaint a chur ar ceal, caithfidh tú fógra i scríbhinn a thabhairt do An Post 2 sheachtain roimh réidh - féach ar an seoladh thíos

source: Remember to give your name, address, PPS number and details of the deductions you want to cancel, including the account number
ga: Ná déan dearmad d'ainm, seoladh, uimhir PSP agus sonraí na hasbhainte gur mian leat a chur ar ceal a thabhairt, uimhir an chuntais san áireamh

source: If you want to cancel the deductions paid to a housing body you must include a letter of authorisation from the housing body
ga: Más mian leat na hasbhaintí íoctha le comhlacht tithíochta a chur ar ceal, caithfidh tú litir údaraithe ón gcomhlacht tithíochta a iniamh

source: To open an account complete a Household Budget Deduction Instruction Form for each bill you want to make a weekly payment towards
ga: Comhlíontar Foirm Ordaithe d' Asbhaint Bhuiséadta Teaghlaigh le haghaidh gach bille gur mian leat íocaíochtaí seachtainiúla a dhéanamh ina treo agus tú ag oscailt cuntais faoin Scéim Bhuiséadta Teaghlaigh

source: Send your completed form marked 'Freepost' (you do not need a stamp) to the address below
ga: Seol d'fhoirm chomhlánaithe le 'Saorphost' uirthi (níl stampa ag teastáil) chuig an seoladh thíos

source: Forms are also available in your local Post Office
ga: Tá foirmeacha ar fáil go háitiúil san Oifig an Phoist chomh maith

source: It will take about 28 days to process your request to have deductions made from your social welfare payment
ga: Tógfaidh sé tuairim agus 28 lá chun d'iarratas ar asbhaintí ó d'íocaíocht leas shóisialaigh a phróiseáil

source: Further questions about the Household Budget Scheme is available from An Post at the address below. Household Budget Scheme Freepost An Post G.P.O
ga: Faigh freagraí ar thuilleadh ceisteanna faoin Scéim Bhuiséadta Teaghlaigh ó An Post ag an seoladh thíos
